Reports/TestSuitePartOne/20190803_181932/requests/main/3.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "request" : {
        "method" : "SOAP",
        "url" : "http://www.dneonline.com/calculator.asmx?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <Subtract xmlns=\"http://tempuri.org/\">\n            <intA>30</intA>\n            <intB>20</intB>\n        </Subtract>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 346,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><SubtractResponse xmlns=\"http://tempuri.org/\"><SubtractResult>10</SubtractResult></SubtractResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 183,
        "bodySize" : 346,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "blocked" : -1,
        "wait" : 0,
        "send" : 0,
        "receive" : 0,
        "dns" : -1,
        "connect" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "3",
        "testObjectId" : "Object Repository/PartOne/3-Request-Substract",
        "harId" : "502c59a6-a24b-4745-83f1-2d6358152bc7"
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}